{ 
  "heading" : {
  	"en" : "Hi, I'm Rahul Arora,"},

  "lead" : { 
  	"en" : "a recent PhD graduate in Computer Graphics and Interaction at <a href='http://www.dgp.toronto.edu'>DGP</a> lab at the University of Toronto, advised by <a href='http://www.dgp.toronto.edu/~karan' target='_blank'>Karan Singh</a>. I will be joining Facebook Reality Labs in Fall 2021."},

  "about" : {
  	"en" : "<p>In my thesis, I utilize <b>3D interactions in immersive realities (AR/VR)</b> for 3D sketching, modelling, and animation. Broadly, I am interested in building <b>user-centric tools for creative applications of computer graphics</b>, including modelling, animation, fabrication, and stylization. I also like to dabble a bit in geometry processing and human perception.</p>
	<p>During my PhD, I have had the great pleasure of collaborating with reseachers at <a href='https://research.adobe.com/' target='_blank'>Adobe</a> and <a href='https://autodeskresearch.com/' target='_blank'>Autodesk</a>, via multiple internships as well as independent collaborations with individual researchers. My collaboration with Autodesk was aided by a <a href='https://www.mitacs.ca/en/programs/accelerate' target='_blank'>Mitacs Accelerate</a> award for industrial collaborations. My research has also been funded by the 2019 <a href='https://research.adobe.com/fellowship' target='_blank'>Adobe Research Fellowship</a>, the 2020 Wolfond Fellowship in Wireless Information Technology, and the 2021 Lansdale/Okino Computer Graphics Fellowship.</p>
	<p>Before I took a short 14-hour flight from Delhi to Toronto, I finished my masters and undergrad in Computer Science and Engineering at IIT Kanpur in India. For my masters thesis, I worked with <a href='http://www-sop.inria.fr/members/Adrien.Bousseau/' target='_blank'>Adrien Bousseau</a> and <a href='http://www.cse.iitk.ac.in/users/vinaypn/' target='_blank'>Vinay P. Namboodiri</a> on shape and view interpolation of design sketches. I worked with <a href='http://www.cse.iitk.ac.in/users/rtewari/' target='_blank'>Raghunath Tewari</a> on the complexity of the perfect matching problem during my undergrad.</p>
	<p>In early 2020, my <a href='http://www.dgp.toronto.edu/projects/michell/' target='_blank'>Volumetric Michell Truss project</a> was displayed as an exhibit at University of Toronto&#39;s Robarts Library. The project was one of three selected in a <a href='https://onesearch.library.utoronto.ca/grad-exhibit-awards' target='_blank'>university-wide competition</a>.</p>"},

  "picture" : "rahul_arora_aug_2021.jpg"
}
