{ 
  "heading" : {
  	"en" : "Hi, I'm Rahul Arora,"},

  "lead" : { 
  	"en" : "a PhD candidate in Computer Graphics and Interaction at <a href='http://www.dgp.toronto.edu'>DGP</a> lab at the University of Toronto. I am advised by <a href='http://www.dgp.toronto.edu/~karan' target='_blank'>Karan Singh</a>."},

  "about" : {
  	"en" : "<p>I am broadly interested in utilizing 3D interactions in immersive realities (AR/VR) for design, modelling and fabrication applications. I'm also interested in the full sketch-based/curve-based design pipeline, starting from acquisition, to processing, and finally to surfacing or fabrication.</p>
	<p>During my PhD, I have collaborated with reseachers at <a href='https://research.adobe.com/' target='_blank'>Adobe</a> and <a href='https://autodeskresearch.com/' target='_blank'>Autodesk</a>, via multiple internships as well as independent collaborations with individual researchers. My collaboration with Autodesk was aided by a <a href='https://www.mitacs.ca/en/programs/accelerate' target='_blank'>Mitcas Accelerate</a> award for industrial collaborations. My research has also been funded by the 2019 <a href='https://research.adobe.com/fellowship' target='_blank'>Adobe Research Fellowship</a>. For the 2019–20 academic year, I received the Wolfond Fellowship in Wireless Information Technology.</p>
	<p>Before I took a short 14-hour flight from Delhi to Toronto, I finished my masters and undergrad in Computer Science and Engineering at IIT Kanpur in India. For my masters thesis, I worked with <a href='http://www-sop.inria.fr/members/Adrien.Bousseau/' target='_blank'>Adrien Bousseau</a> and <a href='http://www.cse.iitk.ac.in/users/vinaypn/' target='_blank'>Vinay P. Namboodiri</a> on shape and view interpolation of design sketches. I worked with <a href='http://www.cse.iitk.ac.in/users/rtewari/' target='_blank'>Raghunath Tewari</a> on the complexity of the perfect matching problem during my undergrad.</p>
	<p>My <a href='http://www.dgp.toronto.edu/projects/michell/' target='_blank'>Volumetric Michell Truss project</a> is currently being displayed as an exhibit at University of Toronto&#39;s Robarts Library. The project was one of three selected in a <a href='https://onesearch.library.utoronto.ca/grad-exhibit-awards' target='_blank'>university-wide competition</a>. If you are around the UofT campus between Jan 13 and Feb 29, 2020, please <a href='https://goo.gl/maps/uPDBYEsSuJY1gZEKA' target='_blank'>visit the majestic library</a> and take a look at the exhibit on the first floor!</p>"},

  "picture" : "rahul_arora_may_2016.jpg"
}
